---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.Generate
enum: Autodesk.Revit.UI.PostableCommand
zh: 创建、新建、生成、建立、新增
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.Generate

**中文**: 创建、新建、生成、建立、新增

Creates the energy analytical model and generates design options and potential performance outcomes with Insight.